Обучение_8310/src/Documents/Продажа/Продажа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Продажа</name>
  <registerRecords>AccountingRegister.РегистрБухгалтерии1</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВазиморасчетыСКонтрагентом</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставнойТип</name>
    <type>
      <types>CatalogRef.Товары</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Характеристика</types>
      <types>CatalogRef.Склад</types>
      <types>CatalogRef.Элементы</types>
      <types>CatalogRef.ВидыТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Обучение_8310/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.Характеристика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Обучение_8310/src/AccumulationRegisters/ВазиморасчетыСКонтрагентом/ВазиморасчетыСКонтрагентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВазиморасчетыСКонтрагентом</name>
  <resources>
    <name>Сумма</name>
    <comment>Долг контрагента перед нами</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Обучение_8310/src/Documents/Продажа/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Сообщить("Я поменял тут");
	// запрос остатков		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажаТабличнаяЧасть.Товар,
	|	СУММА(ПродажаТабличнаяЧасть.Количество) КАК Количество,
	|	СУММА(ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	|ИЗ
	|	Документ.Продажа.ТабличнаяЧасть КАК ПродажаТабличнаяЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(, Склад = &Склад) КАК ОстаткиТоваровОстатки
	|		ПО ПродажаТабличнаяЧасть.Товар = ОстаткиТоваровОстатки.Товар
	|ГДЕ
	|	ПродажаТабличнаяЧасть.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажаТабличнаяЧасть.Товар
	|
	|";
	
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// при выполнении запроса в транзакции накладывается S блокировка
	Результат = Запрос.Выполнить();
	// в управляемом режиме - снимается сразу после выполненя запроса
	// в автоматическом - держится до конца транзакции (до окончания проведения)
		
	// проверка на наличие отрицательных остатков
	ВыборкаДетальныеЗаписи = Результат.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 		
		Если (ВыборкаДетальныеЗаписи.КоличествоОстаток - ВыборкаДетальныеЗаписи.Количество < 0) Тогда
			Сообщить("Недостаточно товара " + ВыборкаДетальныеЗаписи.Товар);
			Отказ = Истина;
		КонецЕсли;		
	КонецЦикла;
	
	// формируем движения регистра ОстаткиТоваров
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяЧасть2 Из ТабличнаяЧасть Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = ТекСтрокаТабличнаяЧасть2.Товар;
		Движение.Количество = ТекСтрокаТабличнаяЧасть2.Количество;
	КонецЦикла;
	
	// формируем движения регистра ВазиморасчетыСКонтрагентом
	Движения.ВазиморасчетыСКонтрагентом.Очистить();
	Движения.ВазиморасчетыСКонтрагентом.Записывать = Истина;
	Движение = Движения.ВазиморасчетыСКонтрагентом.Добавить();	
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;		
	Движение.Сумма = ТабличнаяЧасть.Итог("Сумма");
	
	// запись движений, здесь накладывается X блокировка
	Движения.ОстаткиТоваров.Записать();
	Если (Константы.ПаузаПриПроведении.Получить()) Тогда
		// пауза сделана намеренно
		КипВнешнийКомпонент.Пауза(КипВнешнийКомпонент.ПолучитьИнструменты(), 5000); 
	КонецЕсли;  

	Движения.ВазиморасчетыСКонтрагентом.Записать();	
	
	//////////////////////////////////////////////////////
		
	
КонецПроцедуры
